In [66]:
import pandas as pd
import sqlite3

In [3]:
data = pd.read_csv('Netflix_Data.csv')

In [5]:
data.head(3)

,User ID,Subscription Type,Monthly Revenue,Join Date,Last Payment Date,Country,Age,Gender,Device,Plan Duration
0,1,Basic,10,15-01-22,10-06-23,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,05-09-21,22-06-23,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,28-02-23,27-06-23,United Kingdom,42,Male,Smart TV,1 Month

In [8]:
naveen_data = data[['Country', 'Age']]

naveen_data.head(10)

          Country  Age
0   United States   28
1          Canada   35
2  United Kingdom   42
3       Australia   51
4         Germany   33
5          France   29
6          Brazil   46
7          Mexico   39
8           Spain   37
9           Italy   44

In [14]:
print(naveen_data['Age'].max())
print(naveen_data['Age'].min())
51-26

51
26

25

In [18]:
bins = [0,30,35,40,45,60]
group_names = ['<30', '30-34', '35-39', '40-44', '>45' ]

In [71]:
naveen_data['Age_Bins'] = pd.cut(naveen_data['Age'], bins, labels = group_names, include_lowest = True)

naveen_data

C:\Users\navee\AppData\Local\Temp\ipykernel_31536\1900321353.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  naveen_data['Age_Bins'] = pd.cut(naveen_data['Age'], bins, labels = group_names, include_lowest = True)

             Country  Age Age_Bins
0      United States   28      <30
1             Canada   35    30-34
2     United Kingdom   42    40-44
3          Australia   51      >45
4            Germany   33    30-34
...              ...  ...      ...
2495           Spain   28      <30
2496           Spain   33    30-34
2497   United States   38    35-39
2498          Canada   48      >45
2499   United States   35    30-34

[2500 rows x 3 columns]

In [67]:
con = sqlite3.connect('NetflixUser.db')
cur = con.cursor()

In [68]:
cur.execute("DROP TABLE IF EXISTS NetflixUser;")
df.to_sql('NetflixUser', con, index=False)

50

In [70]:
cur.execute("SELECT * FROM NetflixUser")
for row in cur:
    print(row)

('Australia', '<30', 38)
('Australia', '30-34', 33)
('Australia', '35-39', 39)
('Australia', '40-44', 30)
('Australia', '>45', 43)
('Brazil', '<30', 40)
('Brazil', '30-34', 30)
('Brazil', '35-39', 39)
('Brazil', '40-44', 34)
('Brazil', '>45', 40)
('Canada', '<30', 51)
('Canada', '30-34', 61)
('Canada', '35-39', 79)
('Canada', '40-44', 51)
('Canada', '>45', 75)
('France', '<30', 26)
('France', '30-34', 43)
('France', '35-39', 32)
('France', '40-44', 37)
('France', '>45', 45)
('Germany', '<30', 19)
('Germany', '30-34', 40)
('Germany', '35-39', 50)
('Germany', '40-44', 32)
('Germany', '>45', 42)
('Italy', '<30', 36)
('Italy', '30-34', 32)
('Italy', '35-39', 35)
('Italy', '40-44', 41)
('Italy', '>45', 39)
('Mexico', '<30', 24)
('Mexico', '30-34', 47)
('Mexico', '35-39', 34)
('Mexico', '40-44', 38)
('Mexico', '>45', 40)
('Spain', '<30', 77)
('Spain', '30-34', 97)
('Spain', '35-39', 78)
('Spain', '40-44', 87)
('Spain', '>45', 112)
('United Kingdom', '<30', 27)
('United Kingdom', '30-34', 33)
('United Kingdom', '35-39', 40)
('United Kingdom', '40-44', 42)
('United Kingdom', '>45', 41)
('United States', '<30', 85)
('United States', '30-34', 77)
('United States', '35-39', 88)
('United States', '40-44', 93)
('United States', '>45', 108)